if OS.mac?
    # taps
    tap "homebrew/cask"
    tap "homebrew/cask-fonts"

    brew "mas"
    brew "noti"
    brew "trash"

    # Applications
    cask "iterm2"
    cask "imageoptim"
    cask "anybar"
    cask "soundsource"
    cask "farrago"
    cask "loopback"
    cask "audio-hijack"
    cask "paw"
    cask "postman"
    # cask "hazel"
    # cask "istat-menus"
    # cask "textbar"
    # cask "rocket"
    # cask "vmware-fusion"
    # cask "choosy"

    # Browsers
    cask "firefox"
    cask "google-chrome"

    # Fonts
    cask "font-fira-code"
    cask "font-jetbrains-mono"
    cask "font-cascadia-mono"
    cask "font-3270-nerd-font"
    cask "font-fira-code-nerd-font"
    cask "font-fira-mono-nerd-font"
    cask "font-hack-nerd-font"
    cask "font-inconsolata-nerd-font"
    cask "font-meslo-lg-nerd-font"

    # macOS App Store
    mas "Xcode", id: 497799835
    mas "ColorSlurp", id: 1287239339
    mas "Telegram Lite", id: 946399090
    mas "Xcode", id: 497799835
    mas "Keynote", id: 409183694
    mas "HP Smart", id: 1474276998
    mas "iMovie", id: 408981434
    mas "Flycut", id: 442160987
    mas "GIPHY CAPTURE", id: 668208984
    mas "Slack", id: 803453959
    mas "WhatsApp", id: 1147396723
    mas "Pages", id: 409201541
    mas "Flow", id: 1423210932
    mas "Amphetamine", id: 937984704
    mas "Numbers", id: 409203825
elsif OS.linux?
    brew "xclip"
end

tap "homebrew/bundle"
tap "homebrew/core"

# packages
brew "ack"
brew "awscli"
brew "bat"
brew "cloc"
brew "cowsay"
brew "ctags"
brew "curl"
brew "diff-so-fancy"
brew "entr"
brew "exa"
brew "fd"
brew "fish"
brew "fontconfig"
brew "fortune"
brew "fzf"
brew "gettext"
brew "gh"
brew "git"
brew "git-quick-stats"
brew "gnupg"
brew "go"
brew "gradle"
brew "grep"
brew "htop"
brew "httpie"
brew "icu4c"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "lnav"
brew "lolcat"
brew "markdown"
brew "maven"
brew "mysql"
brew "neofetch"
brew "neovim"
brew "nghttp2"
brew "node"
brew "openjdk"
brew "php"
brew "protobuf"
brew "python"
brew "python@3.9"
brew "readline"
brew "ripgrep"
brew "ruby"
brew "shellcheck"
brew "sqlite"
brew "terminal-notifier"
brew "tmux"
brew "tree"
brew "vim"
brew "watch"
brew "wdiff"
brew "webp"
brew "wget"
